Revit 2026 API

# FieldKeyType Property

---

The type of the keys stored in the field.

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Type KeyType { get; }
```
```vb
Public ReadOnly Property KeyType As Type
	Get
```
```cpp
public:
property Type^ KeyType {
	Type^ get ();
}
```
```fsharp
member KeyType : Type with get
```

#### Property Value

Type

For key-value maps, this is the key type. For all other field, this is NULL.

#### Reference

Field Class

Autodesk.Revit.DB.ExtensibleStorage Namespace